'''
1.合并操作
两个对象相加操作，会合并两个对象。适用于字符串、列表、元组
2.复制
对象自身按指定次数进行+操作。适用于字符串、列表、元组
3.in 判断元素是否存在
判断指定元素是否存在于对象中。适用于字符串、列表、元组、字典

总结：列表在python中主要用来存储数据
      元组跟列表非常相似，不同的是元组一旦创建完毕不能再做修改，只能查找
      字典相当于一个小的数据库
'''

str1 = '这是字符串1'
str2 = '这是字符串2'
list1 = ['列表1', 'fdsaf', 100, 100.99, ['嵌套在列表中的列表']]
list2 = ['列表2', 'fdsaf2', 1002, 100.992, ['嵌套在列表中的列表2']]
tuple1 = ('元组1', 'asdf', 12, 12.3, ('嵌套在元组中的元组'), ['嵌套在元组中的列表'])
tuple2 = ('元组2', 'asdf2', 122, 12.32, ('嵌套在元组中的元组2'), ['嵌套在元组中的列表2'])
dict1 = {'name':'lkl', 'age': 23, 'address':'luohe'}
dict2 = {'name2':'lkl', 'age2': 23, 'address2':'luohe'}
print('字符串1为：', str1)
print('字符串2为：', str2)
print('列表1为：', list1)
print('列表2为：', list2)
print('元组1为：', tuple1)
print('元组2为：', tuple2)
print('创建的字典为：', dict)

# 进行合并操作 +
print('------------------------合并操作（+）------------------------')
print('字符串加上列表的结果：', str1 + str2)
print('列表list1+list2的结果', list1 + list2)
print('元组tuple1+tuple2的结果:', tuple1 + tuple2)
# print('字典dict1+dict2的结果：', dict1 + dict2)   # 字典不能进行相加操作

print('-------------------------复制操作----------------------------')
print('字符串str1复制三次', str1*3)
print('列表list1复制三次：', list1*3)
print('元组tuple1复制三次：', tuple1*3)
# print('字典dict1复制三次：', dict1*3)  # 字典不能进行赋值操作

print('---------------------in判断元素是否存在-----------------------')
print('判断任意元素"asdf"是否在字符串中', 'asdf' in str1)
print('判断任意元素12是否在列表中', 12 in list1)
print('判断任意元素"元组1"是否在元组中', '元组1' in tuple1)
print('判断任意元素(这里指key)23是否在字典中', 'age' in dict1)  # 这里指键key是否在字典中